Catalogs/ЗаписиКалендаряПодготовкиОтчетности.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.19">
	<Catalog>
		<Properties>
			<Name>ЗаписиКалендаряПодготовкиОтчетности</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ДатаСменыСостояния</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДополнительнаяИнформация</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
						<v8:Type>xs:string</v8:Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:TypeSet>cfg:AnyIBRef</v8:TypeSet>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Завершено</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СобытиеКалендаря</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КалендарьПодготовкиОтчетности</v8:Type>
						<v8:Type>cfg:CatalogRef.КалендарьПерсональныхЗадачОтчетности</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Состояние</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СостоянияСобытийКалендаря</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаНалога</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЭтоТочныйРасчет</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПредставлениеСуммыНалога</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

CommonModules/РегламентированнаяОтчетностьУСНКлиент/Ext/Module.bsl
#Область ПрограммныйИнтерфейс

///////////////////////////////////////////////////////////////////////////////
// КЛИЕНТСКИЕ ПРОЦЕДУРЫ И ФУНКЦИИ СВЯЗАННЫЕ С РЕГЛАМЕНТИРОВАННОЙ ОТЧЕТНОСТЬЮ УСН


// Функция производит обработку события календаря в зависимости от задачи
// Параметры:
//		Организация - СправочникСсылка.Организации - ОЕ по которой производится обработка события
//		СобытиеКалендаря - СправочникСсылка.КалендарьПодготовкиОтчетности -  событие календаря отчетности
//   Возвращает:
//		СтруктураОбработки - ФиксированнаяСтруктура - структура, содержащая данные результата расчета,
//			в зависимости от рассчитываемого налога, взноса, формируемой отчтности
//
Функция ОбработатьСобытиеКалендаря(Организация, СобытиеКалендаря) Экспорт
	
	СтруктураСобытия = РегламентированнаяОтчетностьУСН.ПолучитьДанныеСобытия(
		СобытиеКалендаря, 
		"Задача,ДатаНачалаСобытия,ДатаОкончанияСобытия,ДатаДокументаОбработкиСобытия");
	
	Если СтруктураСобытия.ТипЗадачи = "РасчетЕдиногоНалога" Тогда
		Возврат РассчитатьЕдиныйНалог(Организация, СтруктураСобытия.ДатаДокументаОбработкиСобытия, СобытиеКалендаря); 
	ИначеЕсли СтруктураСобытия.ТипЗадачи = "НалогАУСН" Тогда
		Возврат ПодготовитьЗадачуОплатыАУСН(Организация, СтруктураСобытия.ДатаДокументаОбработкиСобытия, СобытиеКалендаря);
	ИначеЕсли СтруктураСобытия.ТипЗадачи = "РасчетАвансовогоПлатежа" Тогда
		Возврат РассчитатьАвансовыйПлатежПоУСН(Организация, СтруктураСобытия.ДатаДокументаОбработкиСобытия, СобытиеКалендаря);
	ИначеЕсли СтруктураСобытия.ТипЗадачи = "ФормированиеДекларацииПоУСН" Тогда
		Возврат СформироватьДекларациюПоУСН(Организация, СтруктураСобытия.ДатаДокументаОбработкиСобытия, СобытиеКалендаря);
	ИначеЕсли СтруктураСобытия.ТипЗадачи = "РасчетСтраховыхВзносовИП" Тогда
		Возврат РассчитатьСтраховыеВзносы(Организация, СтруктураСобытия.ДатаДокументаОбработкиСобытия, СобытиеКалендаря);
	ИначеЕсли СтруктураСобытия.ТипЗадачи = "РасчетНалоговСотрудников" Тогда
		Возврат РассчитатьНДФЛПоСотрудникам(Организация, СтруктураСобытия.ДатаДокументаОбработкиСобытия, СобытиеКалендаря);
	ИначеЕсли СтруктураСобытия.ТипЗадачи = "ФормированиеДекларацииЕНВД" Тогда
		Возврат СформироватьДекларациюПоЕНВД(Организация, СтруктураСобытия.ДатаДокументаОбработкиСобытия, СобытиеКалендаря);
	ИначеЕсли СтруктураСобытия.ТипЗадачи = "РасчетЕдиногоНалогаЕНВД" Тогда
		Возврат РассчитатьПлатежПоЕНВД(Организация, СтруктураСобытия.ДатаДокументаОбработкиСобытия, СобытиеКалендаря);
	ИначеЕсли СтруктураСобытия.ТипЗадачи = "ФормированиеСреднесписочнойЧисленности" Тогда
		Возврат СформироватьСведенияОСреднесписочнойЧисленности(Организация, СтруктураСобытия.ДатаДокументаОбработкиСобытия, СобытиеКалендаря);
	ИначеЕсли СтруктураСобытия.ТипЗадачи = "ФормированиеСправок2НДФЛ" Тогда
		Возврат СформироватьСправки2НДФЛ(Организация, СтруктураСобытия.ДатаДокументаОбработкиСобытия, СобытиеКалендаря);
	ИначеЕсли СтруктураСобытия.ТипЗадачи = "ФормированиеОтчетностиВПФР" Тогда
		Возврат СформироватьОтчетностьВФПР(Организация, СтруктураСобытия.ДатаДокументаОбработкиСобытия, СобытиеКалендаря);
	ИначеЕсли СтруктураСобытия.ТипЗадачи = "Формирование4ФСС" Тогда
		Возврат СформироватьФорму4ФСС(Организация, СтруктураСобытия.ДатаДокументаОбработкиСобытия, СобытиеКалендаря);
	ИначеЕсли СтруктураСобытия.ТипЗадачи = "СтраховыеВзносыПриДоходахСвыше300тр" Тогда 
		Возврат РассчитатьСтраховыеВзносыПриДоходахСвыше300тр(Организация, СтруктураСобытия.ДатаДокументаОбработкиСобытия, СобытиеКалендаря);
	ИначеЕсли СтруктураСобытия.ТипЗадачи ="НалогПатент" Тогда
		Возврат РассчитатьПатент(Организация, СтруктураСобытия.ДатаДокументаОбработкиСобытия, СобытиеКалендаря);
	ИначеЕсли СтруктураСобытия.ТипЗадачи = "ТорговыйСбор" Тогда
		Возврат РассчитатьТорговыйСбор(Организация, СтруктураСобытия.ДатаДокументаОбработкиСобытия, СобытиеКалендаря);
	ИначеЕсли СтруктураСобытия.ТипЗадачи = "Форма1Предприниматель" Тогда
		Возврат СформироватьФорму1Предприниматель(Организация, СтруктураСобытия.ДатаДокументаОбработкиСобытия, СобытиеКалендаря);
	ИначеЕсли СтруктураСобытия.ТипЗадачи = "Форма6НДФЛ" Тогда
		Возврат СформироватьФорму6НДФЛ(Организация, СтруктураСобытия.ДатаДокументаОбработкиСобытия, СобытиеКалендаря);
	ИначеЕсли СтруктураСобытия.ТипЗадачи = "СведенияОЗастрахованныхЛицах" Тогда
		Возврат СформироватьСЗВМ(Организация, СтруктураСобытия.ДатаДокументаОбработкиСобытия, СобытиеКалендаря);
	ИначеЕсли СтруктураСобытия.ТипЗадачи = "СЗВСтаж" Тогда
		Возврат СформироватьСЗВСтаж(Организация, СтруктураСобытия.ДатаДокументаОбработкиСобытия, СобытиеКалендаря);
	ИначеЕсли СтруктураСобытия.ТипЗадачи = "Декларация12" Тогда
		Возврат СформироватьДекларацию12(Организация, СтруктураСобытия.ДатаДокументаОбработкиСобытия, СобытиеКалендаря);
	ИначеЕсли СтруктураСобытия.ТипЗадачи = "Декларация8" Тогда
		Возврат СформироватьДекларацию8(Организация, СтруктураСобытия.ДатаДокументаОбработкиСобытия, СобытиеКалендаря);		
	ИначеЕсли СтруктураСобытия.ТипЗадачи = "РасчетПоСтраховымВзносам" Тогда
		Возврат СформироватьРасчетПоСтраховымВзносам(Организация, СтруктураСобытия.ДатаДокументаОбработкиСобытия, СобытиеКалендаря);   
	ИначеЕсли СтруктураСобытия.ТипЗадачи = "РасчетСтраховыхВзносовЗаСотрудников" Тогда
		Возврат РассчитатьВзносыПоСотрудникам(Организация, СтруктураСобытия.ДатаДокументаОбработкиСобытия, СобытиеКалендаря);	
	ИначеЕсли СтруктураСобытия.ТипЗадачи = "СведенияОФизлицах" Тогда
		Возврат СформироватьПерсонифицированныеСведенияОФизлицах(Организация, СтруктураСобытия.ДатаДокументаОбработкиСобытия, СобытиеКалендаря);		
	КонецЕсли;
	
КонецФункции

// Функция подготовливает задачу оплаты налога по АУСН по отчетной единице на дату документа обработки события
//
// Параметры:
//		Организация
//		ДатаДокументаОбработкиСобытия - ДатаВремя - дата документа, регистрирующего данные расчета
//   Возвращает:
//		Структура
//
Функция ПодготовитьЗадачуОплатыАУСН(Организация, ДатаДокументаОбработкиСобытия,СобытиеКалендаря) Экспорт
	
	РезультатРасчета = РегламентированнаяОтчетностьУСН.ПодоготовитьЗадачуАУСН(Организация, ДатаДокументаОбработкиСобытия, СобытиеКалендаря);
	
	РезультатРасчета.Вставить("ИмяФормыРезультата", "Обработка.ОбработкиНалоговИОтчетности.Форма.НалогАУСН");
	
	Возврат РезультатРасчета;
	
КонецФункции

// Функция производит расчет единого налога по отчетной единице на дату документа обработки события
//
// Параметры:
//		Организация
//		ДатаДокументаОбработкиСобытия - ДатаВремя - дата документа, регистрирующего данные расчета
//   Возвращает:
//		СтруктураРасчетаЕдиногоНалога - ФиксированнаяСтруктура - структура, содержащая данные результата расчета единого налога
//
Функция РассчитатьЕдиныйНалог(Организация, ДатаДокументаОбработкиСобытия, СобытиеКалендаря) Экспорт
	
	СформироватьЗаписиКУДиРЗаГод(Организация, ДатаДокументаОбработкиСобытия, СобытиеКалендаря);
	
	
	РезультатРасчета = РегламентированнаяОтчетностьУСН.ВыполнитьРасчетЕдиногоНалога(Организация,ДатаДокументаОбработкиСобытия, СобытиеКалендаря);
	
	Состояние(
		НСтр("ru='Рассчитано'"),
		,
		НСтр("ru='Единый налог рассчитан'"),
		БиблиотекаКартинок.Рассчет32
	);
	
	РезультатРасчета.Вставить("ИмяФормыРезультата", "Обработка.ОбработкиНалоговИОтчетности.Форма.ЕдиныйНалог");
	
	Возврат РезультатРасчета;
	
КонецФункции

// Функция производит расчет авансового платежа по УСН по отчетной единице на дату документа обработки события
//
// Параметры:
//		Организация
//		ДатаДокументаОбработкиСобытия - ДатаВремя - дата документа, регистрирующего данные расчета
//   Возвращает:
//		Структура
//
Функция РассчитатьАвансовыйПлатежПоУСН(Организация, ДатаДокументаОбработкиСобытия,СобытиеКалендаря) Экспорт
	
	СформироватьЗаписиКУДиРЗаГод(Организация, ДатаДокументаОбработкиСобытия, СобытиеКалендаря);
	
	РезультатРасчета = РегламентированнаяОтчетностьУСН.ВыполнитьРасчетАвансовогоПлатежа(Организация,ДатаДокументаОбработкиСобытия, СобытиеКалендаря);
	
	Состояние(
		НСтр("ru='Рассчитано'"),
		,
		НСтр("ru='Авансовый платеж рассчитан'"),
		БиблиотекаКартинок.Рассчет32);
	
	РезультатРасчета.Вставить("ИмяФормыРезультата", "Обработка.ОбработкиНалоговИОтчетности.Форма.АвансовыйПлатежПоУСН");
	
	Возврат РезультатРасчета;
	
КонецФункции

// Функция производит формирование декларации по УСН
//
// Параметры:
//		Организация
//		ДатаДокументаОбработкиСобытия - ДатаВремя - дата документа, регистрирующего данные расчета
//   Возвращает:
//		Структура
//
Функция СформироватьДекларациюПоУСН(Организация, ДатаДокументаОбработкиСобытия,СобытиеКалендаря) Экспорт
	
	СформироватьЗаписиКУДиРЗаГод(Организация, ДатаДокументаОбработкиСобытия, СобытиеКалендаря);
	
	РезультатРасчета = РегламентированнаяОтчетностьУСН.СформироватьДекларациюПоУСН(Организация,ДатаДокументаОбработкиСобытия, СобытиеКалендаря);
	// контроль 14го года и новой декларации
	Если ДатаДокументаОбработкиСобытия < Дата(2014,1,1) Тогда
		ИмяФормыРО = "ФормаОтчета2009Кв1";
	ИначеЕсли ДатаДокументаОбработкиСобытия < Дата(2015,1,1) Тогда
		ИмяФормыРО = "ФормаОтчета2014Кв1";
	ИначеЕсли ДатаДокументаОбработкиСобытия > Дата(2015,1,1) И ДатаДокументаОбработкиСобытия < Дата(2021,1,1) Тогда 
		ИмяФормыРО = "ФормаОтчета2015Кв1";     
	ИначеЕсли ДатаДокументаОбработкиСобытия < Дата(2023,12,31) Тогда 
		ИмяФормыРО = "ФормаОтчета2021Кв1";  		
	ИначеЕсли ДатаДокументаОбработкиСобытия < Дата(2024,12,31) Тогда
	    ИмяФормыРО = "ФормаОтчета2023Кв1";    
	Иначе
		ИмяФормыРО = "ФормаОтчета2024Кв1";
	КонецЕсли;
	
	Если Не РезультатРасчета.НалоговыйПериодПропущен Тогда
		// Проверка на существование документа отчетности,
		// Если таковой документ не существует, то сохраняем новый
		Если РезультатРасчета.ДокументОтчетности = Неопределено Тогда
			
			Параметры = Новый Структура(
				"Организация,мДатаНачалаПериодаОтчета,мДатаКонцаПериодаОтчета,БезОткрытияФормы,мВыбраннаяФорма,ДатаПодписи,БезОткрытияФормы",
				РезультатРасчета.Организация,
				НачалоГода(РезультатРасчета.ДатаДокументаОбработкиСобытия),
				КонецГода(РезультатРасчета.ДатаДокументаОбработкиСобытия),
				Истина,
				ИмяФормыРО,
				ТекущаяДата(),
				Истина);
		Иначе
			Параметры = Новый Структура(
			"мДатаНачалаПериодаОтчета,мДатаКонцаПериодаОтчета,мПериодичность,Организация,мВыбраннаяФорма,мСохраненныйДок,БезОткрытияФормы",
			РезультатРасчета.ПараметрыФормыДокумента.ДатаНачала,
			РезультатРасчета.ПараметрыФормыДокумента.ДатаОкончания,
			РезультатРасчета.ПараметрыФормыДокумента.Периодичность,
			Организация,
			РезультатРасчета.ПараметрыФормыДокумента.ВыбраннаяФорма,
			РезультатРасчета.ДокументОтчетности, 
			Истина);
		КонецЕсли;
		
		Параметры.Вставить("СформироватьФормуОтчетаАвтоматически", Истина);
		
		Форма = ПолучитьФорму("Отчет.РегламентированныйОтчетУСН.Форма."+ИмяФормыРО, Параметры);
		
		Форма.СохранитьНаКлиенте(Ложь);
	КонецЕсли;
	
	РезультатРасчета.Вставить("ИмяФормыРезультата", "Обработка.ОбработкиНалоговИОтчетности.Форма.ДекларацияПоУСН");
	
	Возврат РезультатРасчета;
	
КонецФункции

// Функция производит формирование декларации по УСН
//
// Параметры:
//		Организация
//		ДатаДокументаОбработкиСобытия - ДатаВремя - дата документа, регистрирующего данные расчета
//   Возвращает:
//		Структура
//
Функция СформироватьФорму4ФСС(Организация, ДатаДокументаОбработкиСобытия,СобытиеКалендаря) Экспорт
	
	
	РезультатРасчета = РегламентированнаяОтчетностьУСН.Сформировать4ФСС(Организация,ДатаДокументаОбработкиСобытия, СобытиеКалендаря);
	Если ДатаДокументаОбработкиСобытия < '20130630' Тогда
		ФормаОтчета = "ФормаОтчета2012Кв1";
	ИначеЕсли ДатаДокументаОбработкиСобытия < '20140101' Тогда
		ФормаОтчета = "ФормаОтчета2013Кв2";
	ИначеЕсли ДатаДокументаОбработкиСобытия < '20150101' Тогда
		ФормаОтчета = "ФормаОтчета2014Кв1";
	ИначеЕсли ДатаДокументаОбработкиСобытия < '20160101' Тогда
		ФормаОтчета = "ФормаОтчета2015Кв1";
	ИначеЕсли ДатаДокументаОбработкиСобытия < '20160701' Тогда
		ФормаОтчета = "ФормаОтчета2016Кв1";
	ИначеЕсли ДатаДокументаОбработкиСобытия < '20170101' Тогда
		ФормаОтчета = "ФормаОтчета2016Кв3";
	ИначеЕсли ДатаДокументаОбработкиСобытия < '20170701' Тогда
		ФормаОтчета = "ФормаОтчета2017Кв1";
	ИначеЕсли ДатаДокументаОбработкиСобытия < '20220630' Тогда
		ФормаОтчета = "ФормаОтчета2017Кв3";
	ИначеЕсли ДатаДокументаОбработкиСобытия < '20230101' Тогда
		ФормаОтчета = "ФормаОтчета2022Кв2";    
	ИначеЕсли ДатаДокументаОбработкиСобытия < '20240101' Тогда 
		ФормаОтчета= "ФормаОтчета2023Кв1"; 
	Иначе	
		ФормаОтчета= "ФормаОтчета2024Кв1" 
	КонецЕсли;
	
	// Проверка на существование документа отчетности,
	// Если таковой документ не существует, то сохраняем новый
	Если РезультатРасчета.ДокументОтчетности = Неопределено Тогда
		
		Параметры = Новый Структура(
			"Организация,мДатаНачалаПериодаОтчета,мДатаКонцаПериодаОтчета,БезОткрытияФормы,мВыбраннаяФорма,ДатаПодписи,БезОткрытияФормы",
			РезультатРасчета.Организация,
			НачалоГода(РезультатРасчета.ДатаДокументаОбработкиСобытия),
			РезультатРасчета.ДатаДокументаОбработкиСобытия,
			Истина,
			ФормаОтчета,
			ТекущаяДата(),
			Истина);
	Иначе
		Параметры = Новый Структура(
		"мДатаНачалаПериодаОтчета,мДатаКонцаПериодаОтчета,мПериодичность,Организация,мВыбраннаяФорма,мСохраненныйДок,БезОткрытияФормы",
		РезультатРасчета.ПараметрыФормыДокумента.ДатаНачала,
		РезультатРасчета.ПараметрыФормыДокумента.ДатаОкончания,
		РезультатРасчета.ПараметрыФормыДокумента.Периодичность,
		Организация,
		ФормаОтчета,
		РезультатРасчета.ДокументОтчетности,
		Истина);
	КонецЕсли;
	
	Параметры.Вставить("СформироватьФормуОтчетаАвтоматически", Истина); 
	
	Если ДатаДокументаОбработкиСобытия > '20230101' Тогда 	   
		Форма = ПолучитьФорму("Отчет.РегламентированныйОтчетЕФС1ОСС.Форма."+ФормаОтчета, Параметры);
		Форма.СтруктураРеквизитовФормы.мВариант = 0; 
		Форма.Инициализация(Истина);		
		РезультатРасчета.Вставить("ФормаОтчетаДлитОперации", Форма);
	Иначе
		Форма = ПолучитьФорму("Отчет.РегламентированныйОтчет4ФСС.Форма."+ФормаОтчета, Параметры);     
	КонецЕсли;	
	
	Форма.СтруктураРеквизитовФормы.мВариант = 0;
	
	Форма.СохранитьНаКлиенте(Истина);
	
	РезультатРасчета.Вставить("ИмяФормыРезультата", "Обработка.ОбработкиНалоговИОтчетности.Форма.Форма4ФСС");
	
	Возврат РезультатРасчета;
	
КонецФункции

// Функция производит формирование декларации по УСН
//
// Параметры:
//		Организация
//		ДатаДокументаОбработкиСобытия - ДатаВремя - дата документа, регистрирующего данные расчета
//   Возвращает:
//		Структура
//
Функция СформироватьДекларациюПоЕНВД(Организация, ДатаДокументаОбработкиСобытия,СобытиеКалендаря) Экспорт
	
	Отказ = Ложь;
	
	ДокЕнвд = РегламентированнаяОтчетностьЕНВД.ПолучитьДокументПоказателейЕНВД(Организация, ДатаДокументаОбработкиСобытия);
	
	Если НЕ ЗначениеЗаполнено(ДокЕнвд) Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	РезультатРасчета = РегламентированнаяОтчетностьЕНВД.СформироватьДекларациюПоЕНВД(Организация,ДатаДокументаОбработкиСобытия, СобытиеКалендаря);
	
	// контроль 12го года и новой декларации
	Если ДатаДокументаОбработкиСобытия < Дата(2012,1,1) Тогда
		ИмяФормыРО = "ФормаОтчета2010Кв1";
	ИначеЕсли ДатаДокументаОбработкиСобытия < Дата(2014,1,1) Тогда
		ИмяФормыРО = "ФормаОтчета2012Кв1";
	ИначеЕсли ДатаДокументаОбработкиСобытия < Дата(2015,1,1) Тогда
		ИмяФормыРО = "ФормаОтчета2013Кв4";
	ИначеЕсли ДатаДокументаОбработкиСобытия < Дата(2016,1,1) Тогда
		ИмяФормыРО = "ФормаОтчета2015Кв1";
	ИначеЕсли ДатаДокументаОбработкиСобытия < Дата(2017,1,1) Тогда
		ИмяФормыРО = "ФормаОтчета2016Кв1";
	ИначеЕсли ДатаДокументаОбработкиСобытия < Дата(2018,1,1) Тогда
		ИмяФормыРО = "ФормаОтчета2017Кв1";
	ИначеЕсли ДатаДокументаОбработкиСобытия < Дата(2018,7,1) Тогда
		ИмяФормыРО = "ФормаОтчета2018Кв1";
	ИначеЕсли ДатаДокументаОбработкиСобытия < Дата(2018,10,1) Тогда
		ИмяФормыРО = "ФормаОтчета2018Кв3";
	Иначе
		ИмяФормыРО = "ФормаОтчета2018Кв4";
	КонецЕсли;
	
	// Проверка на существование документа отчетности,
	// Если таковой документ не существует, то сохраняем новый
	Если РезультатРасчета.ДокументОтчетности = Неопределено Тогда
		
		Параметры = Новый Структура(
			"Организация,мДатаНачалаПериодаОтчета,мДатаКонцаПериодаОтчета,БезОткрытияФормы,мВыбраннаяФорма,ДатаПодписи,БезОткрытияФормы",
			РезультатРасчета.Организация,
			НачалоКвартала(РезультатРасчета.ДатаДокументаОбработкиСобытия),
			КонецКвартала(РезультатРасчета.ДатаДокументаОбработкиСобытия),
			Истина,
			ИмяФормыРО,
			ТекущаяДата(),
			Истина);
	Иначе
		Параметры = Новый Структура(
		"мДатаНачалаПериодаОтчета,мДатаКонцаПериодаОтчета,мПериодичность,Организация,мВыбраннаяФорма,мСохраненныйДок,БезОткрытияФормы",
		РезультатРасчета.ПараметрыФормыДокумента.ДатаНачала,
		РезультатРасчета.ПараметрыФормыДокумента.ДатаОкончания,
		РезультатРасчета.ПараметрыФормыДокумента.Периодичность,
		Организация,
		РезультатРасчета.ПараметрыФормыДокумента.ВыбраннаяФорма,
		РезультатРасчета.ДокументОтчетности,
		Истина);
	КонецЕсли;
	
	Параметры.Вставить("СформироватьФормуОтчетаАвтоматически", Истина);
	
	Форма = ПолучитьФорму("Отчет.РегламентированныйОтчетЕдиныйНалогНаВмененныйДоход.Форма."+ИмяФормыРО, Параметры);
	
	Форма.СохранитьНаКлиенте(Ложь);
	
	РезультатРасчета.Вставить("ИмяФормыРезультата", "Обработка.ОбработкиНалоговИОтчетности.Форма.ДекларацияПоЕНВД");
	
	Возврат РезультатРасчета;
	
КонецФункции

// Функция производит расчет взносов в ПФР
//
// Параметры:
//		Организация
//		ДатаДокументаОбработкиСобытия - ДатаВремя - дата документа, регистрирующего данные расчета
//   Возвращает:
//		Структура
//
Функция РассчитатьСтраховыеВзносы(Организация, ДатаДокументаОбработкиСобытия,СобытиеКалендаря) Экспорт
	
	Отказ = Ложь;
	// Возможно какая то процедура будет тут
	
	Если Отказ Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	РезультатРасчета = РегламентированнаяОтчетностьУСН.ВыполнитьРасчетВзносовВПФРиФСС(Организация,ДатаДокументаОбработкиСобытия, СобытиеКалендаря);
	
	РезультатРасчета.Вставить("ИмяФормыРезультата", "Обработка.ОбработкиНалоговИОтчетности.Форма.СтраховыеВзносыИП");
	
	Возврат РезультатРасчета;
	
КонецФункции

// Функция производит расчет НДФЛ 
//
// Параметры:
//		Организация
//		ДатаДокументаОбработкиСобытия - ДатаВремя - дата документа, регистрирующего данные расчета
//   Возвращает:
//		Структура
//
Функция РассчитатьНДФЛПоСотрудникам(Организация, ДатаДокументаОбработкиСобытия,СобытиеКалендаря) Экспорт
	
	Отказ = Ложь;
	// Возможно какая то процедура будет тут
	
	Если Отказ Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	РезультатРасчета = РегламентированнаяОтчетностьСотрудники.ВыполнитьРасчетВзносовИНалоговПоСотрудникам(Организация,ДатаДокументаОбработкиСобытия, СобытиеКалендаря);
	
	РезультатРасчета.Вставить("ИмяФормыРезультата", "Обработка.ОбработкиНалоговИОтчетности.Форма.НалогиСотрудников");
	
	Возврат РезультатРасчета;
	
КонецФункции 

// Функция производит расчет страховых взносов
//
// Параметры:
//		Организация
//		ДатаДокументаОбработкиСобытия - ДатаВремя - дата документа, регистрирующего данные расчета
//   Возвращает:
//		Структура
//
Функция РассчитатьВзносыПоСотрудникам(Организация, ДатаДокументаОбработкиСобытия,СобытиеКалендаря) Экспорт
	
	Отказ = Ложь;
	// Возможно какая то процедура будет тут
	
	Если Отказ Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	РезультатРасчета = РегламентированнаяОтчетностьСотрудники.ВыполнитьРасчетВзносовПоСотрудникам(Организация,ДатаДокументаОбработкиСобытия, СобытиеКалендаря);
	
	РезультатРасчета.Вставить("ИмяФормыРезультата", "Обработка.ОбработкиНалоговИОтчетности.Форма.НалогиСотрудниковСтраховыеВзносы");
	
	Возврат РезультатРасчета;
	
КонецФункции

// Функция производит расчет суммы по ЕНВД
//
// Параметры:
//		Организация
//		ДатаДокументаОбработкиСобытия - ДатаВремя - дата документа, регистрирующего данные расчета
//   Возвращает:
//		Структура
//
Функция РассчитатьПлатежПоЕНВД(Организация, ДатаДокументаОбработкиСобытия,СобытиеКалендаря) Экспорт
	
	Отказ = Ложь;
	// Возможно какая то процедура будет тут
	
	Если Отказ Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	РезультатРасчета = РегламентированнаяОтчетностьЕНВД.ВыполнитьРасчетЕНВД(Организация,ДатаДокументаОбработкиСобытия, СобытиеКалендаря);
	
	РезультатРасчета.Вставить("ИмяФормыРезультата", "Обработка.ОбработкиНалоговИОтчетности.Форма.ЕдиныйНалогЕНВД");
	
	Возврат РезультатРасчета;
	
КонецФункции

// Функция производит формирование сведений о среднесписочной численности
//
// Параметры:
//		Организация
//		ДатаДокументаОбработкиСобытия - ДатаВремя - дата документа, регистрирующего данные расчета
//   Возвращает:
//		Структура
//
Функция СформироватьСведенияОСреднесписочнойЧисленности(Организация, ДатаДокументаОбработкиСобытия,СобытиеКалендаря) Экспорт
	
	
	РезультатРасчета = РегламентированнаяОтчетностьУСН.СформироватьСведенияОСреднесписочнойЧисленности(Организация,ДатаДокументаОбработкиСобытия, СобытиеКалендаря);
	
	// Проверка на существование документа отчетности,
	// Если таковой документ не существует, то сохраняем новый
	Если РезультатРасчета.ДокументОтчетности = Неопределено Тогда
		
		Параметры = Новый Структура(
			"Организация,мДатаНачалаПериодаОтчета,мДатаКонцаПериодаОтчета,БезОткрытияФормы,мВыбраннаяФорма,ДатаПодписи,БезОткрытияФормы",
			РезультатРасчета.Организация,
			НачалоГода(РезультатРасчета.ДатаДокументаОбработкиСобытия),
			КонецГода(РезультатРасчета.ДатаДокументаОбработкиСобытия),
			Истина,
			"ФормаОтчета2007Кв1",
			ТекущаяДата(),
			Истина);
	Иначе
		Параметры = Новый Структура(
		"мДатаНачалаПериодаОтчета,мДатаКонцаПериодаОтчета,мПериодичность,Организация,мВыбраннаяФорма,мСохраненныйДок,БезОткрытияФормы",
		РезультатРасчета.ПараметрыФормыДокумента.ДатаНачала,
		РезультатРасчета.ПараметрыФормыДокумента.ДатаОкончания,
		РезультатРасчета.ПараметрыФормыДокумента.Периодичность,
		Организация,
		РезультатРасчета.ПараметрыФормыДокумента.ВыбраннаяФорма,
		РезультатРасчета.ДокументОтчетности,
		Истина);
	КонецЕсли;
	
	Параметры.Вставить("СформироватьФормуОтчетаАвтоматически", Истина);
	
	Форма = ПолучитьФорму("Отчет.РегламентированныйОтчетСведенияОСреднесписочнойЧисленностиРаботников.Форма.ФормаОтчета2007Кв1", Параметры);
	
	Форма.СохранитьНаКлиенте(Ложь);
	
	РезультатРасчета.Вставить("ИмяФормыРезультата", "Обработка.ОбработкиНалоговИОтчетности.Форма.СведенияОСреднесписочнойЧисленности");
	
	Возврат РезультатРасчета;
	
КонецФункции

// Функция производит формирование персонифицированные сведений о физических лицах
//
// Параметры:
//		Организация
//		ДатаДокументаОбработкиСобытия - ДатаВремя - дата документа, регистрирующего данные расчета
//   Возвращает:
//		Структура
//
Функция СформироватьПерсонифицированныеСведенияОФизлицах(Организация, ДатаДокументаОбработкиСобытия,СобытиеКалендаря) Экспорт	
	
	РезультатРасчета = РегламентированнаяОтчетностьУСН.СформироватьПерсонифицированныеСведенияОФизлицах(Организация,ДатаДокументаОбработкиСобытия, СобытиеКалендаря);

	// Проверка на существование документа отчетности,
	// Если таковой документ не существует, то сохраняем новый
	Если РезультатРасчета.ДокументОтчетности = Неопределено Тогда
		
		Параметры = Новый Структура(
			"Организация,мДатаНачалаПериодаОтчета,мДатаКонцаПериодаОтчета,БезОткрытияФормы,мВыбраннаяФорма,ДатаПодписи,БезОткрытияФормы,СформироватьФормуОтчетаАвтоматически",
			РезультатРасчета.Организация,
			НачалоМесяца(РезультатРасчета.ДатаДокументаОбработкиСобытия),
			КонецМесяца(РезультатРасчета.ДатаДокументаОбработкиСобытия),
			Истина,
			"ФормаОтчета2023Кв1",
			ТекущаяДата(),
			Истина,
			Истина);
	Иначе
		Параметры = Новый Структура(
		"мДатаНачалаПериодаОтчета,мДатаКонцаПериодаОтчета,мПериодичность,Организация,мВыбраннаяФорма,мСохраненныйДок,БезОткрытияФормы,СформироватьФормуОтчетаАвтоматически",
		РезультатРасчета.ПараметрыФормыДокумента.ДатаНачала,
		РезультатРасчета.ПараметрыФормыДокумента.ДатаОкончания,
		РезультатРасчета.ПараметрыФормыДокумента.Периодичность,
		Организация,
		РезультатРасчета.ПараметрыФормыДокумента.ВыбраннаяФорма, 
		РезультатРасчета.ДокументОтчетности,
		Истина,
		Истина);
	КонецЕсли;        
	
	
	Форма = ПолучитьФорму("Отчет.РегламентированныйОтчетПерсонифицированныеСведенияОФизическихЛицах.Форма.ФормаОтчета2023Кв1", Параметры); 
	Форма.СтруктураРеквизитовФормы.мВариант = 0;
	Форма.Инициализация(Истина);	
	Форма.СохранитьНаКлиенте(Истина);
	
	РезультатРасчета.Вставить("ИмяФормыРезультата", "Обработка.ОбработкиНалоговИОтчетности.Форма.ПерсСведенияОФизлицах");
	РезультатРасчета.Вставить("ФормаОтчетаДлитОперации", Форма);
	
	Возврат РезультатРасчета;
	
КонецФункции 

// Функция производит формирование справок 2-НДФЛ
//
// Параметры:
//		Организация
//		ДатаДокументаОбработкиСобытия - ДатаВремя - дата документа, регистрирующего данные расчета
//   Возвращает:
//		Структура
//
Функция СформироватьСправки2НДФЛ(Организация, ДатаДокументаОбработкиСобытия,СобытиеКалендаря) Экспорт
	
	Отказ = Ложь;
	
	РезультатРасчета = РегламентированнаяОтчетностьУСН.СформироватьСправки2НДФЛ(Организация,ДатаДокументаОбработкиСобытия, СобытиеКалендаря);
	
	РезультатРасчета.Вставить("ИмяФормыРезультата", "Обработка.ОбработкиНалоговИОтчетности.Форма.Справки2НДФЛ");
	
	Возврат РезультатРасчета;
	
КонецФункции

// Функция производит формирование справки по РСВ
//
// Параметры:
//		Организация
//		ДатаДокументаОбработкиСобытия - ДатаВремя - дата документа, регистрирующего данные расчета
//   Возвращает:
//		Структура
//
Функция СформироватьОтчетностьВФПР(Организация, ДатаДокументаОбработкиСобытия,СобытиеКалендаря) Экспорт
	
	РезультатРасчета = Новый Структура;
	
	// Формируем комплект отчетности в ПФР.
	РегламентированнаяОтчетностьУСН.СформироватьКомплектОтчетностиВПФР(Организация, ДатаДокументаОбработкиСобытия, СобытиеКалендаря);
	
	РезультатРасчета.Вставить("ИмяФормыРезультата", "Обработка.ОбработкиНалоговИОтчетности.Форма.ОтчетностьВПФР");
	
	Возврат РезультатРасчета;
	
КонецФункции

// Функция производит расчет взносов в ПФР при превышении доходов на 300 тр.
//
// Параметры:
//		Организация
//		ДатаДокументаОбработкиСобытия - ДатаВремя - дата документа, регистрирующего данные расчета
//   Возвращает:
//		Структура
//
Функция РассчитатьСтраховыеВзносыПриДоходахСвыше300тр(Организация, ДатаДокументаОбработкиСобытия,СобытиеКалендаря) Экспорт
	
	Отказ = Ложь;
	// Возможно какая то процедура будет тут
	
	Если Отказ Тогда
		Возврат Неопределено;
	КонецЕсли;

	РегламентированнаяОтчетностьУСН.ВзносыСДоходовПодлежащиеУплате(Организация, ДатаДокументаОбработкиСобытия,СобытиеКалендаря); 
	
	РезультатРасчета = Новый Структура("ИмяФормыРезультата");
	РезультатРасчета.ИмяФормыРезультата = "Обработка.ОбработкиНалоговИОтчетности.Форма.СтраховыеВзносыПриДоходахСвыше300тр";
	
	Возврат РезультатРасчета;
	
КонецФункции

// Функция производит расчет торгового сбора
//
// Параметры:
//		Организация
//		ДатаДокументаОбработкиСобытия - ДатаВремя - дата документа, регистрирующего данные расчета
//   Возвращает:
//		Структура
//
Функция РассчитатьТорговыйСбор(Организация, ДатаДокументаОбработкиСобытия,СобытиеКалендаря) Экспорт
	
	Отказ = Ложь;
	// Возможно какая то процедура будет тут
	
	Если Отказ Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	РезультатРасчета = РегламентированнаяОтчетностьУСН.ВыполнитьРасчетТорговогоСбора(Организация,ДатаДокументаОбработкиСобытия, СобытиеКалендаря);
	
	РезультатРасчета.Вставить("ИмяФормыРезультата", "Обработка.ОбработкиНалоговИОтчетности.Форма.ТорговыйСбор");
	
	Возврат РезультатРасчета;
	
КонецФункции

// Функция производит формирование формы №1-предприниматель
//
// Параметры:
//		Организация
//		ДатаДокументаОбработкиСобытия - ДатаВремя - дата документа, регистрирующего данные расчета
//   Возвращает:
//		Структура
//
Функция СформироватьФорму1Предприниматель(Организация, ДатаДокументаОбработкиСобытия,СобытиеКалендаря) Экспорт
	
	
	РезультатРасчета = РегламентированнаяОтчетностьУСН.СформироватьФорму1Предприниматель(Организация,ДатаДокументаОбработкиСобытия, СобытиеКалендаря);
	ФормаОтчета = "ФормаОтчета2015Кв1";
	
	// Проверка на существование документа отчетности,
	// Если таковой документ не существует, то сохраняем новый
	Если РезультатРасчета.ДокументОтчетности = Неопределено Тогда
		
		Параметры = Новый Структура(
			"Организация,мДатаНачалаПериодаОтчета,мДатаКонцаПериодаОтчета,БезОткрытияФормы,мВыбраннаяФорма,ДатаПодписи,БезОткрытияФормы",
			РезультатРасчета.Организация,
			НачалоГода(РезультатРасчета.ДатаДокументаОбработкиСобытия),
			РезультатРасчета.ДатаДокументаОбработкиСобытия,
			Истина,
			ФормаОтчета,
			ТекущаяДата(),
			Истина);
	Иначе
		Параметры = Новый Структура(
		"мДатаНачалаПериодаОтчета,мДатаКонцаПериодаОтчета,мПериодичность,Организация,мВыбраннаяФорма,мСохраненныйДок,БезОткрытияФормы",
		РезультатРасчета.ПараметрыФормыДокумента.ДатаНачала,
		РезультатРасчета.ПараметрыФормыДокумента.ДатаОкончания,
		РезультатРасчета.ПараметрыФормыДокумента.Периодичность,
		Организация,
		РезультатРасчета.ПараметрыФормыДокумента.ВыбраннаяФорма,
		РезультатРасчета.ДокументОтчетности,
		Истина);
	КонецЕсли;
	
	Параметры.Вставить("СформироватьФормуОтчетаАвтоматически", Истина);
	
	Форма = ПолучитьФорму("Отчет.РегламентированныйОтчетСтатистикаФорма1Предприниматель.Форма."+ФормаОтчета, Параметры);
	Форма.СтруктураРеквизитовФормы.мВариант = 0;
	
	Форма.СохранитьНаКлиенте(Истина);
	
	РезультатРасчета.Вставить("ИмяФормыРезультата", "Обработка.ОбработкиНалоговИОтчетности.Форма.Форма1Предприниматель");
	
	Возврат РезультатРасчета;
	
КонецФункции

// Функция производит формирование сведений о 6-НДФЛ
//
// Параметры:
//		Организация
//		ДатаДокументаОбработкиСобытия - ДатаВремя - дата документа, регистрирующего данные расчета
//   Возвращает:
//		Структура
//
Функция СформироватьФорму6НДФЛ(Организация, ДатаДокументаОбработкиСобытия,СобытиеКалендаря) Экспорт 	
	
	РезультатРасчета = РегламентированнаяОтчетностьУСН.СформироватьФорму6НДФЛ(Организация,ДатаДокументаОбработкиСобытия, СобытиеКалендаря);
	
	Если ДатаДокументаОбработкиСобытия >= '20240101' Тогда 
		ФормаОтчета = "ФормаОтчета2024Кв2";		
	ИначеЕсли ДатаДокументаОбработкиСобытия >= '20230101' Тогда
		ФормаОтчета = "ФормаОтчета2023Кв1";
	ИначеЕсли ДатаДокументаОбработкиСобытия >= '20211231' Тогда
		ФормаОтчета = "ФормаОтчета2021Кв4";
	ИначеЕсли ДатаДокументаОбработкиСобытия > '20210101' Тогда
		ФормаОтчета = "ФормаОтчета2021Кв1";  
	ИначеЕсли ДатаДокументаОбработкиСобытия < '20171231' 
		ИЛИ (ДатаДокументаОбработкиСобытия = '20171231') И (РегламентированнаяОтчетностьКлиентСерверПереопределяемый.ДатаДействияПриказа6НДФЛЗа2017год() > ТекущаяДата()) Тогда
		ФормаОтчета = "ФормаОтчета2016Кв1";
	Иначе
		ФормаОтчета = "ФормаОтчета2017Кв4";
	КонецЕсли;
	
	// Проверка на существование документа отчетности,
	// Если таковой документ не существует, то сохраняем новый
	Если РезультатРасчета.ДокументОтчетности = Неопределено Тогда
		
		Параметры = Новый Структура(
		"Организация,мДатаНачалаПериодаОтчета,мДатаКонцаПериодаОтчета,БезОткрытияФормы,мВыбраннаяФорма,ДатаПодписи,БезОткрытияФормы,СформироватьФормуОтчетаАвтоматически",
		РезультатРасчета.Организация,
		НачалоГода(РезультатРасчета.ДатаДокументаОбработкиСобытия),
		КонецКвартала(РезультатРасчета.ДатаДокументаОбработкиСобытия),
		Истина,
		ФормаОтчета,
		ТекущаяДата(),
		Истина,
		Истина);
	Иначе
		Параметры = Новый Структура(
		"мДатаНачалаПериодаОтчета,мДатаКонцаПериодаОтчета,мПериодичность,Организация,мВыбраннаяФорма,мСохраненныйДок,БезОткрытияФормы,СформироватьФормуОтчетаАвтоматически",
		НачалоГода(РезультатРасчета.ПараметрыФормыДокумента.ДатаНачала),
		РезультатРасчета.ПараметрыФормыДокумента.ДатаОкончания,
		РезультатРасчета.ПараметрыФормыДокумента.Периодичность,
		Организация,
		ФормаОтчета,
		РезультатРасчета.ДокументОтчетности,
		Истина,
		Истина);
	КонецЕсли;
	
	Если ДатаДокументаОбработкиСобытия > '20210101' Тогда 	
		Форма = ПолучитьФорму("Отчет.РегламентированныйОтчет6_НДФЛ.Форма."+ФормаОтчета, Параметры);
		Форма.СтруктураРеквизитовФормы.мВариант = 0; 
		Форма.Инициализация(Истина);		
		РезультатРасчета.Вставить("ФормаОтчетаДлитОперации", Форма);
	Иначе		
		Форма = ПолучитьФорму("Отчет.РегламентированныйОтчет6НДФЛ.Форма." + ФормаОтчета, Параметры); 
		Форма.СтруктураРеквизитовФормы.мВариант = 0;
		
		РегламентированнаяОтчетностьКлиент.Очистить(Форма,, Ложь);
		
		Форма.Инициализация(Истина);
		
		Форма.СохранитьНаКлиенте(Истина);		
	КонецЕсли;	
	
	РезультатРасчета.Вставить("ИмяФормыРезультата", "Обработка.ОбработкиНалоговИОтчетности.Форма.Форма6НДФЛ");
	
	Возврат РезультатРасчета;
	
КонецФункции

// Функция производит формирование сведений об Алкогольной декларации №12
//
// Параметры:
//		Организация
//		ДатаДокументаОбработкиСобытия - ДатаВремя - дата документа, регистрирующего данные расчета
//   Возвращает:
//		Структура
//
Функция СформироватьДекларацию12(Организация, ДатаДокументаОбработкиСобытия,СобытиеКалендаря) Экспорт
	
	
	РезультатРасчета = РегламентированнаяОтчетностьУСН.СформироватьДекларацию12(Организация,ДатаДокументаОбработкиСобытия, СобытиеКалендаря);
	
	// Проверка на существование документа отчетности,
	// Если таковой документ не существует, то сохраняем новый
	Если РезультатРасчета.ДокументОтчетности = Неопределено Тогда
		
		Параметры = Новый Структура(
			"Организация,мДатаНачалаПериодаОтчета,мДатаКонцаПериодаОтчета,БезОткрытияФормы,мВыбраннаяФорма,ДатаПодписи,БезОткрытияФормы,СформироватьФормуОтчетаАвтоматически",
			РезультатРасчета.Организация,
			НачалоКвартала(РезультатРасчета.ДатаДокументаОбработкиСобытия),
			КонецКвартала(РезультатРасчета.ДатаДокументаОбработкиСобытия),
			Истина,
			"ФормаОтчета2012Кв3",
			ТекущаяДата(),
			Истина,
			Истина);
	Иначе
		Параметры = Новый Структура(
		"мДатаНачалаПериодаОтчета,мДатаКонцаПериодаОтчета,мПериодичность,Организация,мВыбраннаяФорма,мСохраненныйДок,БезОткрытияФормы,СформироватьФормуОтчетаАвтоматически",
		РезультатРасчета.ПараметрыФормыДокумента.ДатаНачала,
		РезультатРасчета.ПараметрыФормыДокумента.ДатаОкончания,
		РезультатРасчета.ПараметрыФормыДокумента.Периодичность,
		Организация,
		РезультатРасчета.ПараметрыФормыДокумента.ВыбраннаяФорма,
		РезультатРасчета.ДокументОтчетности,
		Истина,
		Ложь);
	КонецЕсли;
	
	ФормаОтчетаДлитОперации = ПолучитьФорму("Отчет.РегламентированныйОтчетАлкоПриложение12.Форма.ФормаОтчета2012Кв3", Параметры);
	ФормаОтчетаДлитОперации.СтруктураРеквизитовФормы.мВариант = 0;
	
	ФормаОтчетаДлитОперации.ПризнакФормыОтчетности = "4";
	ФормаОтчетаДлитОперации.ПользовательНажалСохранитьОтчет = Истина;
	ФормаОтчетаДлитОперации.СохранитьНаКлиенте( Истина);
	
	РезультатРасчета.Вставить("ИмяФормыРезультата", "Обработка.ОбработкиНалоговИОтчетности.Форма.Декларация12");
	РезультатРасчета.Вставить("ФормаОтчетаДлитОперации", ФормаОтчетаДлитОперации);
	
	Возврат РезультатРасчета;
	
КонецФункции

// Функция производит формирование сведений об Алкогольной декларации №12
//
// Параметры:
//		Организация
//		ДатаДокументаОбработкиСобытия - ДатаВремя - дата документа, регистрирующего данные расчета
//   Возвращает:
//		Структура
//
Функция СформироватьДекларацию8(Организация, ДатаДокументаОбработкиСобытия,СобытиеКалендаря) Экспорт	
	
	РезультатРасчета = РегламентированнаяОтчетностьУСН.СформироватьДекларацию8(Организация,ДатаДокументаОбработкиСобытия, СобытиеКалендаря);
	
	// Проверка на существование документа отчетности,
	// Если таковой документ не существует, то сохраняем новый
	Если РезультатРасчета.ДокументОтчетности = Неопределено Тогда
		
		Параметры = Новый Структура(
			"Организация,мДатаНачалаПериодаОтчета,мДатаКонцаПериодаОтчета,БезОткрытияФормы,мВыбраннаяФорма,ДатаПодписи,БезОткрытияФормы,СформироватьФормуОтчетаАвтоматически, ЭтоПБОЮЛ",
			РезультатРасчета.Организация,
			НачалоКвартала(РезультатРасчета.ДатаДокументаОбработкиСобытия),
			КонецКвартала(РезультатРасчета.ДатаДокументаОбработкиСобытия),
			Истина,
			"ФормаОтчета2021Кв1",
			ТекущаяДата(),
			Истина,
			Истина);
	Иначе
		Параметры = Новый Структура(
		"мДатаНачалаПериодаОтчета,мДатаКонцаПериодаОтчета,мПериодичность,Организация,мВыбраннаяФорма,мСохраненныйДок,БезОткрытияФормы,СформироватьФормуОтчетаАвтоматически, ЭтоПБОЮЛ",
		РезультатРасчета.ПараметрыФормыДокумента.ДатаНачала,
		РезультатРасчета.ПараметрыФормыДокумента.ДатаОкончания,
		РезультатРасчета.ПараметрыФормыДокумента.Периодичность,
		Организация,
		РезультатРасчета.ПараметрыФормыДокумента.ВыбраннаяФорма,
		РезультатРасчета.ДокументОтчетности,
		Истина,
		Ложь);
	КонецЕсли;
	
	ФормаОтчетаДлитОперации = ПолучитьФорму("Отчет.РегламентированныйОтчетАлкоПриложение26.Форма.ФормаОтчета2021Кв1", Параметры);
	ФормаОтчетаДлитОперации.СтруктураРеквизитовФормы.мВариант = 0;	
	
	ФормаОтчетаДлитОперации.ПризнакФормыОтчетности = "4";
	ФормаОтчетаДлитОперации.ПользовательНажалСохранитьОтчет = Истина;
	ФормаОтчетаДлитОперации.СохранитьНаКлиенте( Истина);
	
	РезультатРасчета.Вставить("ИмяФормыРезультата", "Обработка.ОбработкиНалоговИОтчетности.Форма.Декларация8");
	РезультатРасчета.Вставить("ФормаОтчетаДлитОперации", ФормаОтчетаДлитОперации); 	
	
	Возврат РезультатРасчета;
	
КонецФункции

// Функция производит формирование Сведений о застрахованных лицах (СЗВ-М)
//
// Параметры:
//		Организация
//		ДатаДокументаОбработкиСобытия - ДатаВремя - дата документа, регистрирующего данные расчета
//   Возвращает:
//		Структура
//
Функция СформироватьСЗВМ(Организация, ДатаДокументаОбработкиСобытия,СобытиеКалендаря) Экспорт
	
	Отказ = Ложь;
	
	РезультатРасчета = РегламентированнаяОтчетностьУСН.СформироватьСЗВМ(Организация,ДатаДокументаОбработкиСобытия, СобытиеКалендаря);
	
	РезультатРасчета.Вставить("ИмяФормыРезультата", "Обработка.ОбработкиНалоговИОтчетности.Форма.СведенияОЗастрахованныхЛицах");
	
	Возврат РезультатРасчета;
	
КонецФункции

// Функция производит формирование СЗВ-Стаж
//
// Параметры:
//		Организация
//		ДатаДокументаОбработкиСобытия - ДатаВремя - дата документа, регистрирующего данные расчета
//   Возвращает:
//		Структура
//
Функция СформироватьСЗВСтаж(Организация, ДатаДокументаОбработкиСобытия,СобытиеКалендаря) Экспорт
	
	Отказ = Ложь;
	
	РезультатРасчета = РегламентированнаяОтчетностьУСН.СформироватьСЗВСтаж(Организация,ДатаДокументаОбработкиСобытия, СобытиеКалендаря);
	
	РезультатРасчета.Вставить("ИмяФормыРезультата", "Обработка.ОбработкиНалоговИОтчетности.Форма.СЗВСтаж");
	
	Возврат РезультатРасчета;
	
КонецФункции


// Функция производит формирование отчета "Расчет по страховым взносам"
//
// Параметры:
//		Организация
//		ДатаДокументаОбработкиСобытия - ДатаВремя - дата документа, регистрирующего данные расчета
//   Возвращает:
//		Структура
//
Функция СформироватьРасчетПоСтраховымВзносам(Организация, ДатаДокументаОбработкиСобытия,СобытиеКалендаря) Экспорт
	
	
	РезультатРасчета = РегламентированнаяОтчетностьУСН.СформироватьРасчетПоСтраховымВзносам(Организация,ДатаДокументаОбработкиСобытия, СобытиеКалендаря);
	
	Если ДатаДокументаОбработкиСобытия < '20200101'  Тогда
		ФормаОтчета = "ФормаОтчета2017Кв1";
	ИначеЕсли ДатаДокументаОбработкиСобытия < '20201231'  Тогда
		ФормаОтчета = "ФормаОтчета2020Кв1";
	ИначеЕсли ДатаДокументаОбработкиСобытия < '20220101'  Тогда
		ФормаОтчета = "ФормаОтчета2020Кв4";
	ИначеЕсли ДатаДокументаОбработкиСобытия < '20230101' Тогда
		ФормаОтчета = "ФормаОтчета2022Кв1";
	ИначеЕсли ДатаДокументаОбработкиСобытия < '20231231' Тогда
		ФормаОтчета = "ФормаОтчета2023Кв1";    
	ИначеЕсли ДатаДокументаОбработкиСобытия < '20250101' Тогда
		ФормаОтчета = "ФормаОтчета2023Кв3";    
	Иначе
		ФормаОтчета = "ФормаОтчета2025Кв1"; 
	КонецЕсли;
	
	// Проверка на существование документа отчетности,
	// Если таковой документ не существует, то сохраняем новый
	Если РезультатРасчета.ДокументОтчетности = Неопределено Тогда
		
		Параметры = Новый Структура(
			"Организация,мДатаНачалаПериодаОтчета,мДатаКонцаПериодаОтчета,БезОткрытияФормы,мВыбраннаяФорма,ДатаПодписи,БезОткрытияФормы,СформироватьФормуОтчетаАвтоматически",
			РезультатРасчета.Организация,
			НачалоКвартала(РезультатРасчета.ДатаДокументаОбработкиСобытия),
			КонецКвартала(РезультатРасчета.ДатаДокументаОбработкиСобытия),
			Истина,
			ФормаОтчета,
			ТекущаяДата(),
			Истина,
			Истина);
	Иначе
		Параметры = Новый Структура(
		"мДатаНачалаПериодаОтчета,мДатаКонцаПериодаОтчета,мПериодичность,Организация,мВыбраннаяФорма,мСохраненныйДок,БезОткрытияФормы,СформироватьФормуОтчетаАвтоматически",
		РезультатРасчета.ПараметрыФормыДокумента.ДатаНачала,
		РезультатРасчета.ПараметрыФормыДокумента.ДатаОкончания,
		РезультатРасчета.ПараметрыФормыДокумента.Периодичность,
		Организация,
		РезультатРасчета.ПараметрыФормыДокумента.ВыбраннаяФорма, 
		РезультатРасчета.ДокументОтчетности,
		Истина,
		Истина);
	КонецЕсли;
	
	Форма = ПолучитьФорму("Отчет.РегламентированныйОтчетРасчетПоСтраховымВзносам.Форма."+ ФормаОтчета, Параметры);
	Форма.СтруктураРеквизитовФормы.мВариант = 0;
	
	РезультатРасчета.Вставить("ИмяФормыРезультата", "Обработка.ОбработкиНалоговИОтчетности.Форма.РасчетПоСтраховымВзносам");
	РезультатРасчета.Вставить("ФормаОтчетаДлитОперации", Форма);
	
	Возврат РезультатРасчета;
	
КонецФункции

// ВСПОМОГАТЕЛЬНЫЕ ЭКСПОРТНЫЕ ПРОЦЕДУРЫ И ФУНКЦИ

// Процедура определяет регламентированный отчет по событие календаря и открывает его форму
//
// Параметры:
//		Организация - СправочникСсылка.Организации
//		СобытиеКалендаря - СправочникСсылка.КалендарьПодготовкиОтчетности
//
Процедура ОткрытьФормуРегламентированногоОтчетаПоСобытию(Организация = Неопределено,СобытиеКалендаря) Экспорт
	
	ДокументРегламентированнойОтчетности = РегламентированнаяОтчетностьУСН.ПолучитьДокументРегламентированнойОтчетностиПоСобытиюКалендаря(Организация,СобытиеКалендаря);
	
	Если ДокументРегламентированнойОтчетности = Неопределено  Тогда
		ПоказатьПредупреждение(,НСтр("ru='Нет сохраненного отчета. Сформируйте отчет.'"));
		Возврат;
	КонецЕсли;
	
	ПоказатьЗначение(,ДокументРегламентированнойОтчетности);
	
КонецПроцедуры

// Процедура сохраняет файл выгрузки регламентированной отчетности
//
// Параметры:
//		ДокументОтчетности - ДокументСсылка.РгалментированныйОтчет
//
Процедура СохранитьФайлВыгрузкиОтчетности(ДокументОтчетности) Экспорт
	
	ФормаВыгрузкиРеглОтчета = ПолучитьФорму("Документ.ВыгрузкаРегламентированныхОтчетов.Форма.ФормаДокумента", , );
	
	СпДокОсн = Новый СписокЗначений;
	СпДокОсн.Добавить(ДокументОтчетности);
	
	ФормаВыгрузкиРеглОтчета.СформироватьИЗаписать(СпДокОсн);
	
КонецПроцедуры

// Процедура выводит регламентированный очтет на печать в машиночитаемом виде
//
// Параметры:
//		ДокументОтчетности - ДокументСсылка.РегламентированныйОтчет
//
Процедура РаспечататьМашиночитаемыйРегламентированныйОтчет(ДокументОтчетности) Экспорт
	
	
	
	ДанныеДокумента = РегламентированнаяОтчетностьУСН.ПолучитьДанныеДокументаОтчетности(
		ДокументОтчетности,
		"Организация,ДатаПодписи,ВыбраннаяФорма,ДатаНачала,ДатаОкончания,ИсточникОтчета");
	
	ПараметрыФормы = Новый Структура(
		"БезОткрытияФормы,
		|ДатаПодписи,
		|мВыбраннаяФорма,
		|мДатаКонцаПериодаОтчета,
		|мДатаНачалаПериодаОтчета,
		|мСохраненныйДок,
		|Организация",
		Истина,
		ДанныеДокумента.ДатаПодписи,
		ДанныеДокумента.ВыбраннаяФорма,
		ДанныеДокумента.ДатаОкончания,
		ДанныеДокумента.ДатаНачала,
		ДокументОтчетности,
		ДанныеДокумента.Организация);
	
	Форма = ПолучитьФорму("Отчет."+ДанныеДокумента.ИсточникОтчета+".Форма."+ДанныеДокумента.ВыбраннаяФорма, ПараметрыФормы);
	
	// ПечататьСразуСДвухмернымШтрихкодомPDF417
	РегламентированнаяОтчетностьКлиент.ВывестиМашиночитаемуюФорму(Форма, "");
	
	
КонецПроцедуры

// Формирует записи КУДиР за год события
//
Процедура СформироватьЗаписиКУДиРЗаГод(Организация, Знач ДатаДокументаОбработкиСобытия, СобытиеКалендаря) Экспорт
	
	ДатаДокументаОбработкиСобытия = КонецДня(ДатаДокументаОбработкиСобытия);
	
	РегламентированнаяОтчетностьУСН.ВыполнитьФормированияВсехЗаписейКУДИР(ДатаДокументаОбработкиСобытия);
	
КонецПроцедуры

Процедура ПолучитьБанковскийСчетДляУплатыНалога(ОповещениеВыбораСчета, Организация, Форма = Неопределено, ЭлементФормы = Неопределено) Экспорт
	
	СпсБанкСчетов = РегламентированнаяОтчетностьУСН.ПолучитьСписокБанковскихСчетов(Организация);
	
	Если СпсБанкСчетов.Количество() = 0 Тогда
		СпсОтвет = Новый СписокЗначений;
		СпсОтвет.Добавить(КодВозвратаДиалога.Да, НСтр("ru='Показать счета'"));
		СпсОтвет.Добавить(КодВозвратаДиалога.Отмена, НСтр("ru='Отмена'"));
		
		оп = Новый ОписаниеОповещения("ОповещениеВопросаПоказаСпискаСчетов", ЭтотОбъект, Новый Структура("Организация", Организация));
		ПоказатьВопрос(оп, НСтр("ru='Не найдены подходящие банковские счета'"), СпсОтвет);
		Возврат;
	КонецЕсли;
	
	БанковскийСчет = Неопределено;
	
	Если СпсБанкСчетов.Количество() = 1 Тогда
		БанковскийСчет = СпсБанкСчетов[0].Значение;
	Иначе
		оп = Новый ОписаниеОповещения("ОповещениеВыбораСчета", ЭтотОбъект, Новый Структура("ОповещениеВыбораСчета", ОповещениеВыбораСчета));
		#Если ВебКлиент Тогда
		СпсБанкСчетов.ПоказатьВыборЭлемента(оп, НСтр("ru='С какого счета провести оплату'"));
		#Иначе
		Если Форма = Неопределено Тогда
			СпсБанкСчетов.ПоказатьВыборЭлемента(оп, НСтр("ru='С какого счета провести оплату'"));
		Иначе
			Форма.ПоказатьВыборИзМеню(оп, СпсБанкСчетов, ЭлементФормы);
		КонецЕсли;
		#КонецЕсли
		Возврат;
	КонецЕсли;
	
	ВыполнитьОбработкуОповещения(ОповещениеВыбораСчета, БанковскийСчет);
	
КонецПроцедуры

Процедура ОповещениеВопросаПоказаСпискаСчетов(Ответ, Параметры) Экспорт
	Если Ответ = КодВозвратаДиалога.Да Тогда
		ОткрытьФорму("Справочник.БанковскиеСчета.ФормаСписка", Новый Структура("Отбор", Новый Структура("Владелец", Параметры.Организация)));
	КонецЕсли;
КонецПроцедуры

Процедура ОповещениеВыбораСчета(БанковскийСчет, Параметры) Экспорт
	
	Если БанковскийСчет = Неопределено Тогда
		ВыполнитьОбработкуОповещения(Параметры.ОповещениеВыбораСчета, Неопределено);
		Возврат;
	КонецЕсли;
	
	ВыполнитьОбработкуОповещения(Параметры.ОповещениеВыбораСчета, БанковскийСчет.Значение);
	
КонецПроцедуры

// Показывает форму описание вычета НДФЛ
//
// Параметры:
//		КодВычета - Строка - Код Вычета
Процедура ПоказатьОписаниеВычетаНДФЛ(КодВычета) Экспорт
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("ИзМакета", Истина);
	ПараметрыФормы.Вставить("ПутьДоМакета", "Справочник.ВычетыНДФЛ");
	ПараметрыФормы.Вставить("ИмяМакета","Код"+КодВычета);
	ПараметрыФормы.Вставить("Заголовок","Вычет " + КодВычета);
	
	ОткрытьФорму("ОбщаяФорма.ПроизвольныйHTMLТекст",ПараметрыФормы);
	
КонецПроцедуры


// Функция производит расчет суммы по патенту
//
// Параметры:
//		Организация
//		ДатаДокументаОбработкиСобытия - ДатаВремя - дата документа, регистрирующего данные расчета
//   Возвращает:
//		Структура
//
Функция РассчитатьПатент(Организация, ДатаДокументаОбработкиСобытия,СобытиеКалендаря) Экспорт
	
	Отказ = Ложь;
	// Возможно какая то процедура будет тут
	
	Если Отказ Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	РезультатРасчета = РегламентированнаяОтчетностьУСН.ВыполнитьРасчетНалогаПоПатенту(Организация,ДатаДокументаОбработкиСобытия, СобытиеКалендаря);
	
	РезультатРасчета.Вставить("ИмяФормыРезультата", "Обработка.ОбработкиНалоговИОтчетности.Форма.НалогПатент");
	
	Возврат РезультатРасчета;
	
КонецФункции

Функция ОбработкаКомандыНалоговогоРаздела(Задача) Экспорт
	
	ДанныеСобытия = РегламентированнаяОтчетностьУСН.ПолучитьТекущиеДанныеСобытияПоЗадачеКалендаря(
		ПредопределенноеЗначение("Справочник.ЗадачиКалендаряПодготовкиОтчетности."+Задача));
		
	Если ДанныеСобытия.ТолькоПросмотр Или ДанныеСобытия.ЗадачаПрименима Тогда
		ОткрытьФорму("Справочник.ЗаписиКалендаряПодготовкиОтчетности.Форма.КалендарьНалоговИОтчетности", 
			Новый Структура("Задача", ПредопределенноеЗначение("Справочник.ЗадачиКалендаряПодготовкиОтчетности."+Задача)),,Задача);
	Иначе
		ОткрытьФорму("Справочник.ЗаписиКалендаряПодготовкиОтчетности.Форма.КалендарьНалоговИОтчетности",
				Новый Структура("Организация,Задача,Недоступность", ДанныеСобытия.Организация,  ПредопределенноеЗначение("Справочник.ЗадачиКалендаряПодготовкиОтчетности."+Задача), Истина),,Задача);
	КонецЕсли;
	
	
КонецФункции

// Для переданного описания ячейки рег.отчета выбирает подходящий отчет-расшифровку,
// настраивает соотв. вариант и получает подготовленную к показу форму отчета.
// Параметры:
//	ИДОтчета - Строка - идентификатор отчета (совпадает с именем объекта метаданных).
// 	ИДРедакцииОтчета - Строка - идентификатор редакции формы отчета (совпадает с именем формы объекта метаданных).
//  ИДИменПоказателей - Массив - массив идентификаторов имен показателей, по которым формируется расшифровка.
//  ПараметрыОтчета - Структура - структура параметров отчета, необходимых для формирования расшифровки.
// 
Функция ФормаРасшифровкиРегламентированногоОтчета(ИДОтчета, ИДРедакцииОтчета, ИДИменПоказателей, ПараметрыОтчета) Экспорт
	
	Если Не ЗначениеЗаполнено(ИДИменПоказателей) Тогда
		Возврат Неопределено
	КонецЕсли;
	
	ИмяПоказателя = ИДИменПоказателей[0];
	ИмяНабораДанных = "";
	ИмяОтчетаРасшифровки = "";
	ИмяРасчета = "";
	
	Если ИДОтчета = "РегламентированныйОтчет6_НДФЛ" Тогда
		ИмяОтчетаРасшифровки = "Расшифровка6_НДФЛ";
		Если ИДРедакцииОтчета = "ФормаОтчета2021Кв1" Тогда
			ИмяРасчета = "РасчетПоказателей_6НДФЛ_2021Кв1";
		Иначе
			ИмяРасчета = "РасчетПоказателей_6НДФЛ_2021Кв4";
		КонецЕсли;
		ПараметрыОтчета.Вставить("ИмяСКД");
		ДополнитьПараметрыОтчета6НДФЛ_2021(ПараметрыОтчета, ИмяПоказателя);
		ИмяНабораДанных = ПараметрыОтчета.ИмяСКД;
	Иначе
		
	КонецЕсли;
	
	// Подготовка отчета-расшифровки к показу.
	Если ЗначениеЗаполнено(ИмяОтчетаРасшифровки) И ЗначениеЗаполнено(ИмяНабораДанных) Тогда
		
		ПараметрыОтчета.Вставить("ИсточникРасшифровки", "УчетНДФЛЗаполнениеОтчетности");
		ПараметрыОтчета.Вставить("ИмяОтчетаРасшифровки", ИмяОтчетаРасшифровки);
		ПараметрыОтчета.Вставить("ИмяРасчета", ИмяРасчета);
		ПараметрыОтчета.Вставить("ИДИменПоказателей", ИДИменПоказателей);
		
		ФормаРасшифровки = ПолучитьФорму("ОбщаяФорма.РасшифровкаРегламентированногоОтчетаЗарплата", ПараметрыОтчета);
		Возврат ФормаРасшифровки
		
	КонецЕсли;
	
	Возврат Неопределено
	
КонецФункции   

Процедура ДополнитьПараметрыОтчета6НДФЛ_2021(ПараметрыОтчета, ИмяПоказателя)

	Раздел = РазделРегламентированногоОтчетаПоИмениПоказателя(ИмяПоказателя);
	НомерСтроки = СтрокаРегламентированногоОтчетаПоИмениПоказателя(ИмяПоказателя);
	
	ИмяНабораДанных = "";
	ПараметрыОтчета.Вставить("ИмяСКД", ИмяНабораДанных);
	
	ЗаголовокПоля = НСтр("ru='Сумма'");
	Если Раздел = "01" Тогда
		Если НомерСтроки = "022" Тогда
			ИмяНабораДанных = "Раздел1Налоги"
		КонецЕсли;
		Если НомерСтроки = "032" Тогда
			ИмяНабораДанных = "Раздел1Возвраты"
		КонецЕсли;
	ИначеЕсли Раздел = "02" Тогда	
		Если НомерСтроки = "110" Или НомерСтроки = "111" Или НомерСтроки = "112" Или НомерСтроки = "113" Или НомерСтроки = "115" Тогда
			ЗаголовокПоля = НСтр("ru='Сумма дохода'");
			ИмяНабораДанных = "Раздел2Доходы"
		ИначеЕсли НомерСтроки = "130" Тогда
			ЗаголовокПоля = НСтр("ru='Сумма вычета'");
			ИмяНабораДанных = "Раздел2Вычеты"
		ИначеЕсли ЗначениеЗаполнено(НомерСтроки) И НомерСтроки <> "120" И НомерСтроки <> "121" Тогда
			ИмяНабораДанных = "Раздел2Налоги"
		КонецЕсли;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ИмяНабораДанных) Тогда
			
		ПараметрыОтчета.Вставить("ИмяСКД", ИмяНабораДанных);

		ЗаголовокРасшифровки = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
			НСтр("ru='Разд. %1, поле %2'"),
			Формат(Число(Раздел), "ЧРД=."),
			НомерСтроки);
			
		ПараметрыОтчета.Вставить("ЗаголовокРасшифровки",ЗаголовокРасшифровки);
			
		Если Раздел = "02" Тогда
			Если НомерСтроки = "030" Тогда
			ИначеЕсли НомерСтроки = "020" Или НомерСтроки = "025" Тогда
			КонецЕсли;
		КонецЕсли;
		
		ПараметрыОтчета.Вставить("ЗаголовокПоля", ЗаголовокПоля);
	
	КонецЕсли;
	
КонецПроцедуры   

// По переданному имени показателя регламентированного отчета определяет
// раздел отчета, которому принадлежит показатель.
// 
// Параметры:
//	ИмяПоказателя - Строка
//								
//	Возвращаемое значение:
//		Строка описания (из 2 символов) раздела отчета или Неопределено,  
//		если переданное ИмяПоказателя не имеет ожидаемой структуры.	
//			
Функция РазделРегламентированногоОтчетаПоИмениПоказателя(ИмяПоказателя) Экспорт
	
	Если ВРег(Лев(ИмяПоказателя,1)) <> "П" Или СтрДлина(ИмяПоказателя) < 13 Тогда
		Возврат Неопределено
	КонецЕсли;	
	
	Возврат Сред(ИмяПоказателя, 5, 2)
	
КонецФункции

// По переданному имени показателя регламентированного отчета определяет
// номер строки таблицы отчета, в которой расположен показатель.
// 
// Параметры:
//	ИмяПоказателя - Строка
//								
//	Возвращаемое значение:
//		Строка описания (номер из 3 символов) строки таблицы отчета или 
//		Неопределено, если переданное ИмяПоказателя не имеет ожидаемой структуры.	
//			
Функция СтрокаРегламентированногоОтчетаПоИмениПоказателя(ИмяПоказателя) Экспорт
	
	Если ВРег(Лев(ИмяПоказателя,1)) <> "П" Или СтрДлина(ИмяПоказателя) < 13 Тогда
		Возврат Неопределено
	КонецЕсли;	
	
	Возврат Сред(ИмяПоказателя, 9, 3)
	
КонецФункции

// Сохраняет подготовленные выгрузкой данные файлов.
//
// Параметры:
//  ВыгружаемыеДанные - массив структур. Ключи структуры:
//    * АдресФайлаВыгрузки - адрес двоичных данных файла выгрузки во временном хранилище;
//    * ИмяФайлаВыгрузки - короткое имя файла выгрузки (с расширением).
//
Процедура СохранитьФайлВыгрузкиНаКлиенте(ВыгружаемыеДанные) Экспорт
	
	Если ВыгружаемыеДанные = Неопределено Тогда 
		Возврат;
	КонецЕсли;

	#Если НЕ ВебКлиент Тогда
		ПутьВыгрузки = РегламентированнаяОтчетностьКлиент.ПолучитьПутьВыгрузки();
		Если ПутьВыгрузки = Ложь Тогда
			Возврат;
		КонецЕсли;
	#КонецЕсли
	
	Для Каждого ФайлВыгрузки Из ВыгружаемыеДанные Цикл
		
		#Если ВебКлиент Тогда
			Попытка
				ФайловаяСистемаКлиент.СохранитьФайл( Неопределено, ФайлВыгрузки.АдресФайлаВыгрузки, ФайлВыгрузки.ИмяФайлаВыгрузки);
			Исключение
				ТекстСообщения = НСтр("ru='Не удалось записать файл ""%1"". Возможно, недостаточно места на диске, диск защищен от записи или не подключено расширение для работы с файлами.'");
				ТекстСообщения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ТекстСообщения, ФайлВыгрузки.ИмяФайлаВыгрузки);
				
				Сообщение = Новый СообщениеПользователю;
				Сообщение.Текст = ТекстСообщения;
				Сообщение.Сообщить();
			КонецПопытки;
		#Иначе
			ДвоичныйФайл = ПолучитьИзВременногоХранилища(ФайлВыгрузки.АдресФайлаВыгрузки);
			Попытка
				ДвоичныйФайл.Записать(ПутьВыгрузки + ФайлВыгрузки.ИмяФайлаВыгрузки);
				
				ТекстСообщения = НСтр("ru='Файл выгрузки регламентированного отчета ""%1"" сохранен в каталог ""%2"".'");
				ТекстСообщения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ТекстСообщения, ФайлВыгрузки.ИмяФайлаВыгрузки, ПутьВыгрузки);
				
				Сообщение = Новый СообщениеПользователю;
				Сообщение.Текст = ТекстСообщения;
				Сообщение.Сообщить();
			Исключение
				ТекстСообщения = НСтр("ru='Не удалось записать файл ""%1"". Возможно, недостаточно места на диске или диск защищен от записи.'");
				ТекстСообщения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ТекстСообщения, ФайлВыгрузки.ИмяФайлаВыгрузки);
				
				Сообщение = Новый СообщениеПользователю;
				Сообщение.Текст = ТекстСообщения;
				Сообщение.Сообщить();
			КонецПопытки;
		#КонецЕсли
		
	КонецЦикла;
		
КонецПроцедуры

#КонецОбласти
